feaser/openblt/stm32c0_port/Target/Demo/TRICORE_TC2_TC275_Lite_Kit_ADS/Boot/Libraries/iLLD/TC27D/Tricore/Dsadc/Std/IfxDsadc.h
/**
 * \file IfxDsadc.h
 * \brief DSADC  basic functionality
 * \ingroup IfxLld_Dsadc
 *
 * \version iLLD_1_0_1_16_1
 * \copyright Copyright (c) 2022 Infineon Technologies AG. All rights reserved.
 *
 *
 *
 *                                 IMPORTANT NOTICE
 *
 * Use of this file is subject to the terms of use agreed between (i) you or
 * the company in which ordinary course of business you are acting and (ii)
 * Infineon Technologies AG or its licensees. If and as long as no such terms
 * of use are agreed, use of this file is subject to following:
 *
 * Boost Software License - Version 1.0 - August 17th, 2003
 *
 * Permission is hereby granted, free of charge, to any person or organization
 * obtaining a copy of the software and accompanying documentation covered by
 * this license (the "Software") to use, reproduce, display, distribute,
 * execute, and transmit the Software, and to prepare derivative works of the
 * Software, and to permit third-parties to whom the Software is furnished to
 * do so, all subject to the following:
 *
 * The copyright notices in the Software and this entire statement, including
 * the above license grant, this restriction and the following disclaimer, must
 * be included in all copies of the Software, in whole or in part, and all
 * derivative works of the Software, unless such copies or derivative works are
 * solely in the form of machine-executable object code generated by a source
 * language processor.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE, TITLE AND NON-INFRINGEMENT. IN NO EVENT
 * SHALL THE COPYRIGHT HOLDERS OR ANYONE DISTRIBUTING THE SOFTWARE BE LIABLE
 * FOR ANY DAMAGES OR OTHER LIABILITY, WHETHER IN CONTRACT, TORT OR OTHERWISE,
 * ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER
 * DEALINGS IN THE SOFTWARE.
 *
 *
 * \defgroup IfxLld_Dsadc_Std_Enum Enumerations
 * \ingroup IfxLld_Dsadc_Std
 * \defgroup IfxLld_Dsadc_Std_Operative Operative Functions
 * \ingroup IfxLld_Dsadc_Std
 * \defgroup IfxLld_Dsadc_Std_Support Support Functions
 * \ingroup IfxLld_Dsadc_Std
 * \defgroup IfxLld_Dsadc_Std_Interrupt Interrupt Functions
 * \ingroup IfxLld_Dsadc_Std
 * \defgroup IfxLld_Dsadc_Std_IO IO Pin Configuration Functions
 * \ingroup IfxLld_Dsadc_Std
 */

#ifndef IFXDSADC_H
#define IFXDSADC_H 1

/******************************************************************************/
/*----------------------------------Includes----------------------------------*/
/******************************************************************************/

#include "_Impl/IfxDsadc_cfg.h"
#include "Src/Std/IfxSrc.h"
#include "Scu/Std/IfxScuCcu.h"
#include "_PinMap/IfxDsadc_PinMap.h"
#include "IfxDsadc_reg.h"
#include "Cpu/Std/IfxCpu_Intrinsics.h"

/******************************************************************************/
/*--------------------------------Enumerations--------------------------------*/
/******************************************************************************/

/** \addtogroup IfxLld_Dsadc_Std_Enum
 * \{ */
/** \brief Comb Filter (auxiliary) shift control\n
 * Definition in Ifx_DSADC.FCFGA.B.AFSC
 */
typedef enum
{
    IfxDsadc_AuxCombFilterShift_noShift  = 0,  /**< \brief no shift, use full range */
    IfxDsadc_AuxCombFilterShift_shiftBy1 = 1,  /**< \brief Shift by 1 */
    IfxDsadc_AuxCombFilterShift_shiftBy2 = 2,  /**< \brief Shift by 2 */
    IfxDsadc_AuxCombFilterShift_shiftBy3 = 3   /**< \brief Shift by 3 */
} IfxDsadc_AuxCombFilterShift;

/** \brief Comb Filter (auxiliary) configuration/type\n
 * Definition in Ifx_DSADC.FCFGA.B.CFAC
 */
typedef enum
{
    IfxDsadc_AuxCombFilterType_comb1 = 0,  /**< \brief CIC1 */
    IfxDsadc_AuxCombFilterType_comb2 = 1,  /**< \brief CIC2 */
    IfxDsadc_AuxCombFilterType_comb3 = 2,  /**< \brief CIC3 */
    IfxDsadc_AuxCombFilterType_combF = 3   /**< \brief CICF */
} IfxDsadc_AuxCombFilterType;

/** \brief Service request generation (auxiliary)\n
 * Definition in Ifx_DSADC.FCFGA.B.ESEL
 */
typedef enum
{
    IfxDsadc_AuxEvent_everyNewResult  = 0, /**< \brief Always, for each new result value */
    IfxDsadc_AuxEvent_insideBoundary  = 1, /**< \brief If result is inside the boundary band */
    IfxDsadc_AuxEvent_outsideBoundary = 2  /**< \brief If result is outside the boundary band */
} IfxDsadc_AuxEvent;

/** \brief Service request generation (auxiliary)\n
 * Definition in Ifx_DSADC.FCFGA.B.EGT
 */
typedef enum
{
    IfxDsadc_AuxGate_definedByESEL       = 0, /**< \brief Separate: generate events according to ESEL */
    IfxDsadc_AuxGate_coupledToIntegrator = 1  /**< \brief Coupled: generate events only when the integrator is enabled and after the discard phase defined by bitfield NVALDIS */
} IfxDsadc_AuxGate;

/** \brief Service request generation (auxiliary)\n
 * Definition in Ifx_DSADC.FCFGA.B.SRGA
 */
typedef enum
{
    IfxDsadc_AuxServiceRequest_never     = 0,  /**< \brief Never, service requests disabled */
    IfxDsadc_AuxServiceRequest_auxFilter = 1,  /**< \brief Auxiliary filter: As selected by bitfield ESEL (\ref IfxDsadc_AuxEvent) */
    IfxDsadc_AuxServiceRequest_altSource = 2   /**< \brief Alternate source: Capturing of a sign delay value to register CGSYNCx (x = 0 - 5) */
} IfxDsadc_AuxServiceRequest;

/** \brief Carrier generation mode\n
 * Definition in Ifx_DSADC.CGCFG.B.CGMOD
 */
typedef enum
{
    IfxDsadc_CarrierWaveformMode_stopped  = 0,  /**< \brief Carrier Generator stopped */
    IfxDsadc_CarrierWaveformMode_square   = 1,  /**< \brief Carrier Generator generates square wave */
    IfxDsadc_CarrierWaveformMode_triangle = 2,  /**< \brief Carrier Generator generates triangle wave */
    IfxDsadc_CarrierWaveformMode_sine     = 3   /**< \brief Carrier Generator generates sine wave */
} IfxDsadc_CarrierWaveformMode;

/** \brief Specifies the channel Index
 */
typedef enum
{
    IfxDsadc_ChannelId_0 = 0,  /**< \brief Specifies the channel Index 0 */
    IfxDsadc_ChannelId_1 = 1,  /**< \brief Specifies the channel Index 1 */
    IfxDsadc_ChannelId_2 = 2,  /**< \brief Specifies the channel Index 2 */
    IfxDsadc_ChannelId_3 = 3,  /**< \brief Specifies the channel Index 3 */
    IfxDsadc_ChannelId_4 = 4,  /**< \brief Specifies the channel Index 4 */
    IfxDsadc_ChannelId_5 = 5   /**< \brief Specifies the channel Index 5 */
} IfxDsadc_ChannelId;

/** \brief Modulator common mode voltage selection\n
 * Definition in Ifx_DSADC.MODCFGx.B.CMVS
 */
typedef enum
{
    IfxDsadc_CommonModeVoltage_a = 0,  /**< \brief VCM = VAREF / 3.03 (1.65 V for VAREF = 5.0 V), recommended for VDDM = 3.3 V1.65V */
    IfxDsadc_CommonModeVoltage_b = 1,  /**< \brief VCM = VAREF / 2.27 (2.2 V for VAREF = 5.0 V), recommended for low distortion of AC-coupled signals */
    IfxDsadc_CommonModeVoltage_c = 2   /**< \brief VCM = VAREF / 2.0 (2.5 V for VAREF = 5.0 V), recommended for DC-coupled signals */
} IfxDsadc_CommonModeVoltage;

/** \brief FIR data shift control\n
 * Selects the displacement caused by the data shifter at the FIR filter output\n
 * Definition in Ifx_DSADC.FCFGM.B.DSH
 */
typedef enum
{
    IfxDsadc_FirDataShift_noShift  = 0,  /**< \brief no shift, use full range */
    IfxDsadc_FirDataShift_shiftBy1 = 1,  /**< \brief Shift by 1 */
    IfxDsadc_FirDataShift_shiftBy2 = 2,  /**< \brief Shift by 2 */
    IfxDsadc_FirDataShift_shiftBy3 = 3   /**< \brief Shift by 3 */
} IfxDsadc_FirDataShift;

/** \brief FIR shift control\n
 * Selects the displacement caused by the data shifter inbetween the FIR filter blocks.\n
 * Definition in Ifx_DSADC.FCFGM.B.FSH
 */
typedef enum
{
    IfxDsadc_FirInternalShift_noShift  = 0, /**< \brief no shift, use full range */
    IfxDsadc_FirInternalShift_shiftBy1 = 1  /**< \brief Shift by 1 */
} IfxDsadc_FirInternalShift;

/** \brief Modulator configuration of positive/negative input line\n
 * Definition in Ifx_DSADC.MODCFGx.B.INCFGP and Ifx_DSADC.MODCFGx.B.INCFGN
 */
typedef enum
{
    IfxDsadc_InputConfig_inputPin          = 0,  /**< \brief Modulator input connected to external pin */
    IfxDsadc_InputConfig_supplyVoltage     = 1,  /**< \brief Modulator input connected to supply voltage V_ddm */
    IfxDsadc_InputConfig_commonModeVoltage = 2,  /**< \brief Modulator input connected to common mode voltage V_cm */
    IfxDsadc_InputConfig_referenceGround   = 3   /**< \brief Modulator input connected to reference ground V_ref */
} IfxDsadc_InputConfig;

/** \brief Demodulator input data source selection\n
 * Definition in Ifx_DSADC.DICFG.B.DSRC
 */
typedef enum
{
    IfxDsadc_InputDataSource_onChipStandAlone = 0,  /**< \brief On-chip modulator, standalone (3rd order) */
    IfxDsadc_InputDataSource_onChipCombined   = 1,  /**< \brief On-chip modulator, yield (2nd order) */
    IfxDsadc_InputDataSource_directInputA     = 2,  /**< \brief External, from input A, direct */
    IfxDsadc_InputDataSource_invertedInputA   = 3,  /**< \brief External, from input A, inverted */
    IfxDsadc_InputDataSource_directInputB     = 4,  /**< \brief External, from input B, direct */
    IfxDsadc_InputDataSource_invertedInputB   = 5   /**< \brief External, from input B, inverted */
} IfxDsadc_InputDataSource;

/** \brief Modulator gain select of analog input path\n
 * Definition in Ifx_DSADC.MODCFGx.B.GAINSEL
 */
typedef enum
{
    IfxDsadc_InputGain_factor1  = 0, /**< \brief Input gain factor: 1 */
    IfxDsadc_InputGain_factor2  = 1, /**< \brief Input gain factor: 2 */
    IfxDsadc_InputGain_factor4  = 2, /**< \brief Input gain factor: 4 */
    IfxDsadc_InputGain_factor8  = 3, /**< \brief Input gain factor: 8 */
    IfxDsadc_InputGain_factor16 = 4  /**< \brief Input gain factor: 16 */
} IfxDsadc_InputGain;

