feaser/openblt/stm32c0_port/Target/Demo/TRICORE_TC2_TC275_Lite_Kit_ADS/Boot/Libraries/iLLD/TC27D/Tricore/Dsadc/Std/IfxDsadc.h
/** \brief Modulator input pin selection\n
 * Definition in Ifx_DSADC.MODCFGx.B.INMUX
 */
typedef enum
{
    IfxDsadc_InputPin_a = 0,  /**< \brief Pin A connected to modulator input */
    IfxDsadc_InputPin_b = 1,  /**< \brief Pin B connected to modulator input */
    IfxDsadc_InputPin_c = 2,  /**< \brief Pin C connected to modulator input */
    IfxDsadc_InputPin_d = 3   /**< \brief Pin D connected to modulator input */
} IfxDsadc_InputPin;

/** \brief Integrator window size\n
 * Definition in Ifx_DSADC.IWCTR.B.IWS
 */
typedef enum
{
    IfxDsadc_IntegrationWindowSize_internalControl = 0,  /**< \brief Internal control: stop integrator after REPVAL+1 integration cycles */
    IfxDsadc_IntegrationWindowSize_externalControl = 1   /**< \brief External control: stop integrator when bit INTEN becomes 0 */
} IfxDsadc_IntegrationWindowSize;

/** \brief Integrator trigger mode\n
 * NOTE: switch-first to bypassed before using other mode\n
 * Definition in Ifx_DSADC.DICFG.B.ITRMODE
 */
typedef enum
{
    IfxDsadc_IntegratorTrigger_bypassed     = 0, /**< \brief No integration trigger, integrator bypassed */
    IfxDsadc_IntegratorTrigger_fallingEdge  = 1, /**< \brief Trigger event upon a falling edge */
    IfxDsadc_IntegratorTrigger_risingEdge   = 2, /**< \brief Trigger event upon a rising edge */
    IfxDsadc_IntegratorTrigger_alwaysActive = 3  /**< \brief No trigger, integrator active all the time */
} IfxDsadc_IntegratorTrigger;

/** \brief Low power supply voltage select\n
 * Definition in Ifx_DSADC.GLOBCFG.B.LOSUP
 */
typedef enum
{
    IfxDsadc_LowPowerSupply_5V   = 0, /**< \brief Supply Voltage for Analog Circuitry set to 5V */
    IfxDsadc_LowPowerSupply_3_3V = 1  /**< \brief Supply Voltage for Analog Circuitry set to 3.3V */
} IfxDsadc_LowPowerSupply;

/** \brief Comb Filter (Main Chain) shift control\n
 * Definition in Ifx_DSADC.FCFGC.B.MFSC
 */
typedef enum
{
    IfxDsadc_MainCombFilterShift_noShift  = 0,  /**< \brief no shift, use full range */
    IfxDsadc_MainCombFilterShift_shiftBy1 = 1,  /**< \brief Shift by 1 */
    IfxDsadc_MainCombFilterShift_shiftBy2 = 2,  /**< \brief Shift by 2 */
    IfxDsadc_MainCombFilterShift_shiftBy3 = 3   /**< \brief Shift by 3 */
} IfxDsadc_MainCombFilterShift;

/** \brief Comb Filter (Main Chain) configuration/type\n
 * Definition in Ifx_DSADC.FCFGC.B.CFMC
 */
typedef enum
{
    IfxDsadc_MainCombFilterType_comb1 = 0,  /**< \brief CIC1 */
    IfxDsadc_MainCombFilterType_comb2 = 1,  /**< \brief CIC2 */
    IfxDsadc_MainCombFilterType_comb3 = 2,  /**< \brief CIC3 */
    IfxDsadc_MainCombFilterType_combF = 3   /**< \brief CICF */
} IfxDsadc_MainCombFilterType;

/** \brief Service request generation (main chain)\n
 * Definition in Ifx_DSADC.FCFGC.B.SRGM
 */
typedef enum
{
    IfxDsadc_MainServiceRequest_never          = 0,  /**< \brief Never, service requests disabled */
    IfxDsadc_MainServiceRequest_highGateSignal = 1,  /**< \brief While gate (selected trigger signal) is high */
    IfxDsadc_MainServiceRequest_lowGateSignal  = 2,  /**< \brief While gate (selected trigger signal) is low */
    IfxDsadc_MainServiceRequest_everyNewResult = 3   /**< \brief Always, for each new result value */
} IfxDsadc_MainServiceRequest;

/** \brief Modulator clock select\n
 * Definition in Ifx_DSADC.GLOBCFG.B.MCSEL
 */
typedef enum
{
    IfxDsadc_ModulatorClock_off   = 0,  /**< \brief Internal clock off, no source selected */
    IfxDsadc_ModulatorClock_fDSD  = 1,  /**< \brief f_dsd clock selected */
    IfxDsadc_ModulatorClock_fERAY = 2,  /**< \brief f_eray clock selected */
    IfxDsadc_ModulatorClock_fOSC0 = 3   /**< \brief f_osc0 clock selected */
} IfxDsadc_ModulatorClock;

/** \brief Modulator divider factor for modulator clock\n
 * Definition in Ifx_DSADC.MODCFGx.B.DIVM
 */
typedef enum
{
    IfxDsadc_ModulatorClockDivider_div2 = 0,      /**< \brief f_mod = f_clk / 2  */
    IfxDsadc_ModulatorClockDivider_div4,          /**< \brief f_mod = f_clk / 4  */
    IfxDsadc_ModulatorClockDivider_div6,          /**< \brief f_mod = f_clk / 6  */
    IfxDsadc_ModulatorClockDivider_div8,          /**< \brief f_mod = f_clk / 8  */
    IfxDsadc_ModulatorClockDivider_div10,         /**< \brief f_mod = f_clk / 10  */
    IfxDsadc_ModulatorClockDivider_div12,         /**< \brief f_mod = f_clk / 12  */
    IfxDsadc_ModulatorClockDivider_div14,         /**< \brief f_mod = f_clk / 14  */
    IfxDsadc_ModulatorClockDivider_div16,         /**< \brief f_mod = f_clk / 16  */
    IfxDsadc_ModulatorClockDivider_div18,         /**< \brief f_mod = f_clk / 18  */
    IfxDsadc_ModulatorClockDivider_div20,         /**< \brief f_mod = f_clk / 20  */
    IfxDsadc_ModulatorClockDivider_div22,         /**< \brief f_mod = f_clk / 22  */
    IfxDsadc_ModulatorClockDivider_div24,         /**< \brief f_mod = f_clk / 24  */
    IfxDsadc_ModulatorClockDivider_div26,         /**< \brief f_mod = f_clk / 26  */
    IfxDsadc_ModulatorClockDivider_div28,         /**< \brief f_mod = f_clk / 28  */
    IfxDsadc_ModulatorClockDivider_div30,         /**< \brief f_mod = f_clk / 30  */
    IfxDsadc_ModulatorClockDivider_div32          /**< \brief f_mod = f_clk / 32  */
} IfxDsadc_ModulatorClockDivider;

/** \brief Rectifier sign source\n
 * Selects the sign signal that is to be delayed.\n
 * Definition in Ifx_DSADC.RECT.B.SSRC
 */
typedef enum
{
    IfxDsadc_RectifierSignSource_onChipGenerator = 0,  /**< \brief On-chip carrier generator */
    IfxDsadc_RectifierSignSource_nextChannel     = 1,  /**< \brief Sign of result of next channel */
    IfxDsadc_RectifierSignSource_externalA       = 2,  /**< \brief External sign signal A */
    IfxDsadc_RectifierSignSource_externalB       = 3   /**< \brief External sign signal B */
} IfxDsadc_RectifierSignSource;

/** \brief Demodulator sample clock source select\n
 * Definition in Ifx_DSADC.DICFG.B.CSRC
 */
typedef enum
{
    IfxDsadc_SampleClockSource_internal = 0,  /**< \brief Internal clock */
    IfxDsadc_SampleClockSource_inputA   = 1,  /**< \brief External clock, from Input A */
    IfxDsadc_SampleClockSource_inputB   = 2,  /**< \brief External clock, from Input B */
    IfxDsadc_SampleClockSource_inputC   = 3   /**< \brief External clock, from Input C */
} IfxDsadc_SampleClockSource;

/** \brief Demodulator data strobe generation mode\n
 * Definition in Ifx_DSADC.DICFG.B.STROBE
 */
typedef enum
{
    IfxDsadc_SampleStrobe_noDataStrobe            = 0, /**< \brief No data strobe */
    IfxDsadc_SampleStrobe_sampleOnRisingEdge      = 1, /**< \brief Direct clock, a sample trigger is generated at each rising clock edge */
    IfxDsadc_SampleStrobe_sampleOnFallingEdge     = 2, /**< \brief Direct clock, a sample trigger is generated at each falling clock edge */
    IfxDsadc_SampleStrobe_sampleOnBothEdges       = 3, /**< \brief Double data, a sample trigger is generated at each rising and falling clock edge */
    IfxDsadc_SampleStrobe_reserved                = 4, /**< \brief don't use */
    IfxDsadc_SampleStrobe_sampleOnTwoRisingEdges  = 5, /**< \brief Double clock, a sample trigger is generated at every 2nd rising clock edge */
    IfxDsadc_SampleStrobe_sampleOnTwoFallingEdges = 6  /**< \brief Double clock, a sample trigger is generated at every 2nd falling clock edge */
} IfxDsadc_SampleStrobe;

/** \brief Enable/disable the sensitivity of the module to sleep signal\n
 * Definition in Ifx_DSADC.CLC.B.EDIS
 */
typedef enum
{
    IfxDsadc_SleepMode_enable  = 0, /**< \brief enables sleep mode */
    IfxDsadc_SleepMode_disable = 1  /**< \brief disables sleep mode */
} IfxDsadc_SleepMode;

/** \brief Timestamp trigger mode\n
 * Definition in Ifx_DSADC.DICFG.B.TSTRMODE
 */
typedef enum
{
    IfxDsadc_TimestampTrigger_noTrigger   = 0,  /**< \brief No timestamp trigger */
    IfxDsadc_TimestampTrigger_fallingEdge = 1,  /**< \brief Trigger event upon a falling edge */
    IfxDsadc_TimestampTrigger_risingEdge  = 2,  /**< \brief Trigger event upon a rising edge */
    IfxDsadc_TimestampTrigger_eachEdge    = 3   /**< \brief Trigger event upon each edge */
} IfxDsadc_TimestampTrigger;

/** \brief Trigger select\n
 * Definition in Ifx_DSADC.DICFG.B.TRSEL
 */
typedef enum
{
    IfxDsadc_TriggerInput_a = 0,  /**< \brief dsadc trig 0 */
    IfxDsadc_TriggerInput_b = 1,  /**< \brief dsadc trig 1 */
    IfxDsadc_TriggerInput_c = 2,  /**< \brief vadc trig 0 */
    IfxDsadc_TriggerInput_d = 3,  /**< \brief vadc trig 1 */
    IfxDsadc_TriggerInput_e = 4,  /**< \brief external pin e */
    IfxDsadc_TriggerInput_f = 5,  /**< \brief external pin f */
    IfxDsadc_TriggerInput_g = 6,
    IfxDsadc_TriggerInput_h = 7
} IfxDsadc_TriggerInput;

