feaser/openblt/stm32c0_port/Target/Demo/TRICORE_TC2_TC275_Lite_Kit_ADS/Boot/Libraries/iLLD/TC27D/Tricore/Dsadc/Std/IfxDsadc.h
/** \} */

/** \addtogroup IfxLld_Dsadc_Std_Operative
 * \{ */

/******************************************************************************/
/*-------------------------Inline Function Prototypes-------------------------*/
/******************************************************************************/

/** \brief Sets the sensitivity of the module to sleep signal
 * \param dsadc pointer to DSADC registers
 * \param mode mode selection (enable/disable)
 * \return None
 */
IFX_INLINE void IfxDsadc_setSleepMode(Ifx_DSADC *dsadc, IfxDsadc_SleepMode mode);

/** \brief Enables the conversion of multiple channels
 * \param dsadc Pointer to the DSADC register space
 * \param modulatorMask the modulator which should be running (bitwise selection)
 * \param channelMask the channels which should be scanned (bitwise selection)
 * \return None
 *
 * \code
 *     // enable the conversion of all 6 DSADC channels
 *     IfxDsadc_startScan(&MODULE_DSADC, 0x3FU, 0x3FU);
 *     // results are now available in IFXDSADC(ds).CH[x].RESM.B.RESULT (x=0..5)
 * \endcode
 *
 */
IFX_INLINE void IfxDsadc_startScan(Ifx_DSADC *dsadc, uint32 modulatorMask, uint32 channelMask);

/** \brief Disables the conversion of multiple channels
 * \param dsadc Pointer to the DSADC register space
 * \param modulatorMask the modulator which should be disabled (bitwise selection)
 * \return None
 *
 * \code
 *     // disable the modulators of all 6 DSADC channels
 *     IfxDsadc_stopScan(&MODULE_DSADC, 0x3FU);
 * \endcode
 *
 */
IFX_INLINE void IfxDsadc_stopScan(Ifx_DSADC *dsadc, uint32 modulatorMask);

/******************************************************************************/
/*-------------------------Global Function Prototypes-------------------------*/
/******************************************************************************/

/** \brief resets the DSADC kernel
 * \param dsadc pointer to DSADC registers
 * \return None
 */
IFX_EXTERN void IfxDsadc_resetModule(Ifx_DSADC *dsadc);

/** \} */

/** \addtogroup IfxLld_Dsadc_Std_Support
 * \{ */

/******************************************************************************/
/*-------------------------Inline Function Prototypes-------------------------*/
/******************************************************************************/

/** \brief Get result from the auxiliary chain
 * \param dsadc Pointer to the DSADC register space
 * \param channel Channel Id
 * \return result from the auxiliary chain
 */
IFX_INLINE sint16 IfxDsadc_getAuxResult(Ifx_DSADC *dsadc, IfxDsadc_ChannelId channel);

/** \brief Get the main comb decimation factor
 * \param dsadc Pointer to the DSADC register space
 * \param channel Channel Id
 * \return the main comb decimation factor
 */
IFX_INLINE uint16 IfxDsadc_getMainCombDecimation(Ifx_DSADC *dsadc, IfxDsadc_ChannelId channel);

/** \brief Get result from the main chain
 * \param dsadc Pointer to the DSADC register space
 * \param channel Channel Id
 * \return result from the main chain
 */
IFX_INLINE sint16 IfxDsadc_getMainResult(Ifx_DSADC *dsadc, IfxDsadc_ChannelId channel);

/** \brief Return TRUE if DSADC module is enabled
 * \param dsadc Pointer to the DSADC register space
 * \return TRUE if DSADC module is enabled
 */
IFX_INLINE boolean IfxDsadc_isModuleEnabled(Ifx_DSADC *dsadc);

/** \brief Set the carrier waveform mode
 * \param dsadc Pointer to the DSADC register space
 * \param waveformMode the waveform mode
 * \return None
 */
IFX_INLINE void IfxDsadc_setCarrierMode(Ifx_DSADC *dsadc, IfxDsadc_CarrierWaveformMode waveformMode);

/******************************************************************************/
/*-------------------------Global Function Prototypes-------------------------*/
/******************************************************************************/

/** \brief Get the sample frequency of the integrator output in Hz
 * \param dsadc Pointer to the DSADC register space
 * \param channel Channel Id
 * \return frequency in Hz
 */
IFX_EXTERN float32 IfxDsadc_getIntegratorOutFreq(Ifx_DSADC *dsadc, IfxDsadc_ChannelId channel);

/** \brief Get the sample frequency of the main COMB filter output in Hz
 * \param dsadc Pointer to the DSADC register space
 * \param channel Channel Id
 * \return frequency in Hz
 */
IFX_EXTERN float32 IfxDsadc_getMainCombOutFreq(Ifx_DSADC *dsadc, IfxDsadc_ChannelId channel);

/** \brief Estimate the group delay of main-chain filters in seconds
 * \param dsadc Pointer to the DSADC register space
 * \param channel Channel Id
 * \return delay in seconds
 */
IFX_EXTERN float32 IfxDsadc_getMainGroupDelay(Ifx_DSADC *dsadc, IfxDsadc_ChannelId channel);

/** \brief Get the modulator clock frequency in Hz
 * \param dsadc Pointer to the DSADC register space
 * \param channel Channel Id
 * \return frequency in Hz
 */
IFX_EXTERN float32 IfxDsadc_getModulatorClockFreq(Ifx_DSADC *dsadc, IfxDsadc_ChannelId channel);

/** \brief Get the input frequency of DSADC in Hz
 * \param dsadc Pointer to the DSADC register space
 * \return frequency in Hz
 */
IFX_EXTERN float32 IfxDsadc_getModulatorInputClockFreq(Ifx_DSADC *dsadc);

/** \} */

/** \addtogroup IfxLld_Dsadc_Std_Interrupt
 * \{ */

/******************************************************************************/
/*-------------------------Global Function Prototypes-------------------------*/
/******************************************************************************/

/** \brief Address/pointer to the interrupt source register
 * \param dsadc Pointer to the DSADC register space
 * \param channel Channel Id
 * \return Address/pointer to the interrupt source register
 */
IFX_EXTERN volatile Ifx_SRC_SRCR *IfxDsadc_getAuxSrc(Ifx_DSADC *dsadc, IfxDsadc_ChannelId channel);

/** \brief Get the interrupt source register for a Main event
 * \param dsadc Pointer to the DSADC register space
 * \param channel Channel Id
 * \return Address/pointer to the interrupt source register
 */
IFX_EXTERN volatile Ifx_SRC_SRCR *IfxDsadc_getMainSrc(Ifx_DSADC *dsadc, IfxDsadc_ChannelId channel);

